---
type: StructuralSectionIWideFlange
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 8
tags: [revit-api, class]
---

# StructuralSectionIWideFlange

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionIWideFlange | 2015 | `public StructuralSectionIWideFlange ( double width , double height , double flangeThickness , double webThickness , double webFillet , double centroidHorizontal , double centroidVertical , double principalAxesAngle , dou` |
| Property | BoltDiameter | 2015 | `public double BoltDiameter { get ; set ; }` |
| Property | BoltSpacing | 2015 | `public double BoltSpacing { get ; set ; }` |
| Property | BoltSpacingBetweenRows | 2015 | `public double BoltSpacingBetweenRows { get ; set ; }` |
| Property | BoltSpacingTwoRows | 2015 | `public double BoltSpacingTwoRows { get ; set ; }` |
| Property | ClearWebHeight | 2015 | `public double ClearWebHeight { get ; set ; }` |
| Property | FlangeToeOfFillet | 2015 | `public double FlangeToeOfFillet { get ; set ; }` |
| Property | WebToeOfFillet | 2015 | `public double WebToeOfFillet { get ; set ; }` |